Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Matches any character except a newline sequence regardless of option (?s).
fr: Correspond à tout caractère sauf à une séquence de saut de ligne, indépendament de l'option (?s).

source: Only when UCP is enabled: matches any Unicode character having the property ppp.
fr: Seulement quand l'option UCP est activée : correspond à tout caractère Unicode possédant la propriété ppp.

source: E.g."\b\p{Cyrillic}+" matches any cyrillic word; "\p{Sc}" matches any currency symbol.
fr: Par exemple, "\b\p{Cyrillic}+" correspond à tout mot cyrillique ; "\p{Sc}" correspond à tout symbole monétaire.

source: See reference documentation for details.
fr: Consultez la documentation de référence pour plus de détails.

source: Only when UCP is enabled: matches any Unicode character not having the property ppp.
fr: Seulement quand l'option UCP est activée : correspond à tout caractère Unicode ne possédant pas la propriété ppp.

source: Matches any Unicode newline sequence by default, or the currently active (*BSR_...) setting.
fr: Correspond à toute séquence 'newline' Unicode par défaut, ou avec le paramètre (*BSR_...)actif.

source: By default \R matches "(?>\r\n|\n|\r)" where "(?>...)" is an atomic group, making the sequence "\r\n" (@CRLF) unbreakable.
fr: Par défaut \R correspond à "(?>\r\n|\n|\r)" où "(?>...)" est un groupe atomique, entité qui rend la séquence "\r\n" (@CRLF) indivisible.

source: Matches any whitespace character (see table below).
fr: Correspond à tout caractère d'espacement (voir tableau ci-dessous).

source: Matches any non-whitespace character.
fr: Correspond à tout caractère hors espacements.

source: Matches any vertical whitespace character (see table below).
fr: Correspond à tout caractère d'espacement vertical (voir tableau ci-dessous).

source: Matches any character that is not a vertical whitespace character.
fr: Correspond à tout caractère hors espacement vertical.

source: Matches any "word" character: any digit, any letter or underscore "_" (any Unicode digit, any Unicode letter in any language or underscore "_" when UCP is enabled).
fr: Correspond à tout caractère 'mot' : tout chiffre, lettre ou soulignement (underscore "_" ).Tout chiffre, lettre Unicode de tout langage ou soulignement (underscore "_") quand UCP est activé.

source: Matches any non-word character.
fr: Correspond à tout caractère qui n'est pas 'mot'.

source: Only when UCP is enabled: matches any Unicode extended grapheme cluster - an unbreakable sequence of codepoints which represent a single character for the user.
fr: Seulement quand UCP est activé : correspond à tout graphème étendu Unicode - une séquence indivisible de codes qui représente un seul caractère pour l'utilisateur.

source: As a consequence \X may match more than one character in the subject string, contrary to all other sequences in this table.
fr: En conséquence, \X peut correspond à plus d'un caractère dans la chaîne d'origine, contrairement à tous les autres éléments de ce tableau.

source: Sets of "whitespaces characters"
fr: Classification des caractères d'espacement

source: Horizontal whitespace characters matched by \h
fr: Caractères d'espacement horizontal correspondant à \h

source: \h is equivalent to "[\x09 \xA0]" by default (or "[\x09 \xA0\x{1680}\x{180E}\x{2000}-\x{200A}\x{202F}\x{205F}\x{3000}]" when UCP is enabled.)
fr: \h est équivalent à "[\x09 \xA0]" par défaut (ou "[\x09 \xA0\x{1680}\x{180E}\x{2000}-\x{200A}\x{202F}\x{205F}\x{3000}]" quand UCP est activé.)

source: Horizontal tab (HT), Space, Non-break space (adding:Ogham space mark, Mongolian vowel separator, En quad, Em quad, En space, Em space, Three-per-em space, Four-per-em space, Six-per-em space, Figure space, Punctuation space, Thin space, Hair space, Narrow no-break space, Medium mathematical space, Ideographic space when UCP is enabled.)
fr: Cet ensemble se lit aussi : tabulation horizontale (HT), espace, espace insécable (en ajoutant : marque d'espace Ogham, separateur de voyelle Mongolien, demi-cadratin, cadratin, espace demi-cadratin, espace cadratin, tiers de cadratin, quart de cadratin, sixième de cadratin, espace tabulaire, espace de punctuation, espace fine, espace ultra-fine, espace insécable fin, espace mathématique moyen, espace idéographique quand UCP est activé.)

source: Vertical whitespace characters matched by \v
fr: Caractères d'espacement vertical correspondant à \v

source: \v is equivalent to "[\x0A-\x0D]" by default (or "[\x0A-\x0D\x{0085}\x{2028}\x{2029}]" when UCP is enabled.)
fr: \v est équivalent à "[\x0A-\x0D]" par défaut (ou "[\x0A-\x0D\x{0085}\x{2028}\x{2029}]" quand UCP est activé.)

source: This set is:
fr: Cet ensemble se lit aussi :

source: Linefeed (LF), Vertical tab (VT), Form feed (FF), Carriage return (CR) (adding:
fr: Linefeed (LF), Vertical tab (VT), Form feed (FF), Carriage return (CR) (en ajoutant :

source: Next line (NEL), Line separator, Paragraph separator when UCP is enabled.)
fr: Next line (NEL), Line separator, Paragraph separator quand UCP est activé.)

source: Whitespace characters matched by \s
fr: Caractères d'espacement correspondant à \s

source: \s is equivalent to "[\h\x0A\x0C\x0D]".
fr: \s est équivalent à "[\h\x0A\x0C\x0D]".

source: This set is: all characters in \h plus Linefeed (LF), Form feed (FF), Carriage return (CR).
fr: Cet ensemble comprend tous les caractères de \h plus Linefeed (LF), Form feed (FF), Carriage return (CR).

source: Whitespace characters matched by [[:space:]]
fr: Caractères d'espacement correspondant à [[:space:]](voir cette classe POSIX ci-dessous)

source: [[:space:]] is equivalent to "\s".
fr: [[:space:]] est équivalent à "\s".

source: This set is: all characters in \s plus Vertical tab (VT).
fr: Cet ensemble comprend tous les caractères de \s plus Vertical tab (VT).

source: Character classes and POSIX classes
fr: Classes de caractère et classes POSIX

source: Character classes
fr: Classes de caractère

source: A character classes defines a set of allowed (resp. disallowed) characters, which the next character in subject is expected to match (resp. not to match).
fr: Les classes de caractère définissent un ensemble de caractères permis (resp.interdits), auquel le prochain caractère de la chaîne sujet doit appartenir (resp.

source: Inside a character classes, most metacharacters loose their meaning (like $ .
fr: Dans les classes de caractère, la plupart des méta-caractères perdent leur signification spéciale (comme $ .

source: or *) or mean something else (like ^).
fr: ou *) et sont interprétés littéralement ; certains revêtent une autre signification (comme ^).

source: Matches any character in the explicit set:
fr: correspond à tout caractère d'un ensemble explicite :

source: "[aeiou]" matches any lowercase vowel.
fr: "[aeiouy]" correspond à toute voyelle minuscule.

source: A contiguous (in Unicode codepoint increasing order) set can be defined by putting an hyphen between the starting and ending characters:
fr: Un ensemble contigu (en Unicode le code définit un ordre) peut être défini en plaçant un trait d'union entre les caractères de départ et de fin :

source: "[a-z]" matches any lowercase ASCII letter.
fr: "[a-z]" correspond à toute lettre ASCII minuscule.

source: To include a hyphen (-) in a set, put it as the first or last character of the set or escape it (\-).
fr: Pour inclure un tiret (-) dans l'ensemble, placez-le au début ou à la fin de l'ensemble, ou utilisez l'échappement (\-).

source: Notice that the pattern "[A-z]" is not the same as "[A-Za-z]": the former is equivalent to "[A-Z\[\\\]^_`a-z]".
fr: Notez que le modèle "[A-z]" est distinct de "[A-Za-z]" : ce dernier équivaut à "[A-Z\[\\\]^_`a-z]".

source: To include a closing bracket in a set, use it as the first character of the set or escape it:
fr: Pour inclure un crochet fermant dans l'ensemble, placez-le en première position de l'ensemble ou utilisez l'échappement :

source: "[][]" and "[\[\]]" will both match either "[" or "]".
fr: "[][]" ou encore "[\[\]]" correspond à "[" ou "]".

source: Note that in a character class, only \d, \D, \h, \H, \p{}, \P{}, \s, \Q...\E, \S, \v, \V, \w, \W, and \x sequences retain their special meaning, while \b means the backspace character (Chr(8)).
fr: Notez que dans une classe de caractère, seules les séquences \d, \D, \h, \H, \p{}, \P{}, \s, \Q...\E, \S, \v, \V, \w, \W, et \x conservent leur signification spéciale, tandis que \b désigne le caractère retour arrière (Chr(8)).

source: Matches any character not in the set:"[^0-9]" matches any non-digit.
fr: Complémentation d'une classe : correspond à tout caractère qui n'est pas dans l'ensemble :"[^0-9]" correspond à tout caractère qui n'est pas un chiffre décimal ASCII.

source: To include a caret (^) in a set, put it after the beginning of the set or escape it (\^).
fr: Pour inclure un caret (^) dans un ensemble, placez-le ailleurs qu'en première position de l'ensemble ou utilisez l'échappement (\^).

source: POSIX classes
fr: Les classes POSIX

source: These are named sets specifications to be used themselves within a character class:
fr: Ce sont des spécifications d'ensembles prédéfinis destinés à être utilisées elles-mêmes dans une classe de caractère :

source: "[z[:digit:]w-y]" is the same as "[w-z0-9]".
fr: "[z[:digit:]w-y]" est le même modèle que "[w-z0-9]".

source: To negate a POSIX character class, put a caret (^) after the first colon:
fr: Pour complémenter une classe POSIX, placez un caret (^) devant son nom :

source: When UCP is enabled, several POSIX classes extend to some Unicode character subset, else they are by default restricted to 7-bit ASCII.
fr: Quand UCP est activé, certaines classes POSIX s'étendent à des sous-ensembles de caractère Unicode, sinon elles sont par défaut restreintes à des caractères ASCII 7 bits.

source: ASCII letters and digits (same as [^\W_] or [A-Za-z0-9]).
fr: Lettres et chiffres ASCII 7 bits (équivaut à [^\W_] ou encore [A-Za-z0-9]).

source: When UCP is enabled:Unicode letters and digits (same as [^\W_] or \p{Xan}).
fr: Quand UCP est activé : lettres et chiffres Unicode (équivaut à [^\W_] ou \p{Xan}).

source: ASCII letters (same as [^\W\d_] or [A-Za-z]).
fr: Lettres ASCII (équivaut à [^\W\d_] ou [A-Za-z]).

source: When UCP is enabled:Unicode letters (same as [^\W\d_] or \p{L}).
fr: Quand UCP est activé : lettres Unicode (équivaut à [^\W\d_] ou \p{L}).

source: ASCII characters (same as [\x00-\x7F]).
fr: Caractères ASCII 7 bits (équivaut à [\x00-\x7F]).

source: Space or Tab (@TAB) (same as \h or [\x09\x20]).
fr: Espacement horizontal (équivaut à \h ou [\x09\x20]).

source: When UCP is enabled:Unicode horizontal whitespaces (same as \h).
fr: Quand UCP est activé : espacement horizontal Unicode (équivaut à \h).

source: ASCII control characters (same as Chr(0) ...
fr: Caractères de contrôle ASCII (équivaut à Chr(0) ...

source: Chr(31) and Chr(127)).
fr: Chr(31) et Chr(127)).

source: ASCII decimal digits (same as \d or [0-9]).
fr: Chiffres décimaux ASCII (équivaut à \d ou [0-9]).

source: When UCP is enabled:Unicode decimal digits (same as \d or \p{Nd}).
fr: Quand UCP est activé : chiffres décimaux Unicode (équivaut à \d or \p{Nd}).

source: ASCII printing characters, excluding space (same as Chr(33) ...
fr: Caractères ASCII imprimables hors espacements (équivaut à Chr(33) ...

source: ASCII lowercase letters (same as [a-z]).
fr: Lettres minuscules ASCII 7 bits (équivaut à [a-z]).

source: When UCP is enabled:Unicode lowercase letters (same as \p{Ll}).
fr: Quand UCP est activé : lettres minuscules Unicode (équivaut à \p{Ll}).

source: ASCII printing characters, including space (same as Chr(32) ...
fr: Caractères ASCII imprimables ASCII 7 bits, y compris espacements (équivaut à Chr(32) ...

source: ASCII punctuation characters, [:print:] excluding [:alnum:] and space, (33-47, 58-64, 91-96, 123-126).
fr: Caractères de ponctuation ASCII, [:print:] sauf [:alnum:] et Espace, (33-47, 58-64, 91-96, 123-126).

source: ASCII white space (same as [\h\x0A-\x0D]).
fr: Espacements ASCII (équivaut à [\h\x0A-\x0D]).

source: [:space:] is not quite the same as \s: it includes VT, Chr(11)).
fr: [:space:] n'est pas tout à fait équivalant à \s car il inclut VT, Chr(11)).

source: ASCII uppercase letters (same as [A-Z]).
fr: Lettres majuscules ASCII 7 bits (équivaut à [A-Z]).

source: When UCP is enabled:Unicode uppercase letters (same as \p{Lu}).
fr: Quand UCP est activé : lettres majuscules Unicode (équivaut à \p{Lu}).

source: ASCII "Word" characters (same as \w or [[:alnum:]_]).
fr: Caractères 'mot' ASCII 7 bits (équivaut à \w or [[:alnum:]_]).

source: When UCP is enabled:Unicode "word" characters (same as \w or [[:alnum:]_] or \p{Xwd}).
fr: Quand UCP est activé : caractères 'mot' Unicode (équivaut à \w ou [[:alnum:]_] ou \p{Xwd}).

source: Hexadecimal digits (same as [0-9A-Fa-f]).
fr: Chiffres hexadécimaux (équivaut à [0-9A-Fa-f]).

source: Groups
fr: Groupes

source: Groups are used to delimit subpatterns and are the building blocks of powerful expressions.
fr: Les Groupes sont utilisés pour délimiter des sous-modèles et sont les blocs de construction d'expressions puissantes.

source: Groups can be either capturing or not and may be nested irrespective of their nature, except comments groups.
fr: Les groupes peuvent capturer ou pas et peuvent être imbriqués quelle que soit leur nature, à l'exception des groupes de commentaire.

source: A regular expression can contain up to 65535 capturing groups.
fr: Une expression régulière peut contenir jusqu'à 65535 groupes de capture.

source: Option letters (discussed above) can be conveniently inserted between the "?" and the ":" of non-capturing groups:
fr: Les lettres d'option (ci-dessus) peuvent être insérés entre "?"et ":" des groupes non-capturants :

source: "(?-i:[aeiou]{5})" matches 5 lowercase vowels.
fr: "(?-i:[aeiouy]{5})" correspond à 5 voyelles minuscules.

source: In this case options are local to the group.
fr: Dans ce cas, les options sont locales au groupe.

source: Capturing group.
fr: Groupe capturant.

source: The elements in the group are treated in order and can be repeated as a block.
fr: Les éléments d'un groupe sont traités dans l'ordre et peuvent être répétés comme un bloc.

source: E.g."(ab)+c" will match "abc" or "ababc", but not "abac".
fr: Par exemple, "(ab)+c" trouvera "abc" or "ababc", mais pas "abac".

source: Capturing groups remember the text they matched for use in backreferences and they populate the optionally returned array.
fr: Un groupe capturant enregistre le texte auquel il a correspondu et ce contenu est utilisable par référence arrière.Ce contenu se retrouve dans le tableau renvoyé dans certains modes.

source: They are numbered starting from 1 in the order of appearance of their opening parenthesis.
fr: Les groupes capturant sont numérotés à partir de 1 dans l'ordre d'apparition de leur parenthèse ouvrante.

source: Capturing groups may also be treated as subroutines elsewhere in the pattern, possibly recursively.
fr: Les groupes capturant peuvent également être considérés comme des sous-routines, référençables ailleurs dans le modèle, éventuellement de manière récursive.

source: Named capturing group.
fr: Groupe de capture nommé.

source: Can be later referenced by name as well as by number.
fr: Peut être appelé plus tard par son nom aussi bien que par son numéro.

source: Avoid using the name "DEFINE" (see "conditional patterns").
fr: Évitez d'utiliser le nom "DEFINE" (voir "Modèles conditionnels").

source: Non-capturing group.
fr: Groupe non-capturant.

source: Does not record the matching characters in the array and cannot be re-used as backreference.
fr: N'enregistre pas le texte auquel il a correspondu et n'est pas numéroté ; ne peut donc pas être réutilisé par référencence arrière.

source: Non-capturing group with reset.
fr: Groupe non-capturant avec réemploi.

source: Resets capturing group numbers in each top-level alternative it contains:
fr: Affecte le même numéro à tous les groupes capturant de premier niveau figurant dans les alternatives de ce groupe :

source: "(?|(Mon)|(Tue)s|(Wed)nes|(Thu)rs|(Fri)|(Sat)ur|(Sun))day" matches a weekday name and captures its abbreviation in group number 1.
fr: "(?|(Lu)ndi|(Ma)rdi|(Me)rcredi|(Je)udi|(Ve)ndredi|(Sa)medi|(Di)manche)" correspond à un nom de jour de la semaine et capture son abréviation dans le groupe numéro 1.

source: Atomic non-capturing group: locks and never backtracks into (gives back from) what has been matched (see also Quantifiers and greediness below).
fr: Groupe atomique non-capturant : traite le contenu auquel il correspond comme une entité indivisible (voir aussi Quantificateurs et gourmandise ci-dessous).

source: Atomic groups, like possessive quantifiers, are always greedy.
fr: Les groupes atomiques, comme les quantifications possessives, sont toujours gourmands.

source: Comment group: always ignored (but may not contain a closing parenthesis, hence comment groups are not nestable).
fr: Groupe commentaire : toujours ignoré (mais ne peut pas contenir une parenthèse fermante donc les commentaires de groupes ne sont pas emboîtables).

source: Quantifiers and greediness
fr: Quantificateurs et gourmandise

source: Quantifiers (or repetition specifiers) specify how many of the preceding character, class, reference or group are expected to match.
fr: Les Quantificateurs (ou spécificateurs de répétition) spécifient combien de ce qui précède, caractère, classe, référence ou groupe devraient correspondre.

source: Optional greediness qualifiers denote how aggressively the repetition will behave.
fr: Les qualificatifs optionnels de gourmandise indiquent avec quelle agressivité la répétition se comportera.

source: For instance "\d{3,5}" will match at least 3 and no more than 5 decimal digits.
fr: Par exemple "\d{3,5}" correspond à au moins 3 et au plus de 5 chiffres décimaux.

source: By default, patterns are "greedy", which means that quantifiers * + ?
fr: Par défaut, les modèles sont "gourmands", ce qui signifie que les quantificateurs * + ?

source: {...} will match the longest string which doesn't cause the rest of the pattern to fail.
fr: {...}correspondront à la chaîne la plus longue qui ne fera pas échouer le reste du modèle.

source: Greediness can be inverted for the entire pattern by giving option (?U) at the head of the pattern, or locally by placing a question mark following a quantifier.
fr: La gourmandise peut être inversée pour l'ensemble du motif par l'option (?U) en tête du modèle, ou localement en plaçant un point d'interrogation après un quantificateur.

source: Non-greedy (lazy) repetitions will match the smallest string that still allows the rest of the pattern to match.
fr: Les répétitions non-gourmandes (frugales) correspondront à la plus petite chaîne qui permettra au reste du modèle de correspondre.

source: E.g. given the subject "aaab", the pattern "(a*)([ab]+)" will capture "aaa" then "b", but "(?U)(a*)([ab]+)" will capture "" then "a": indeed, capturing an empty string is good enough to satisfy the lazy "(a*)" and capturing "a" matches the lazy "([ab]+)" subpattern.
fr: Par exemple étant donné le sujet "aaab", le modèle "(a*)([ab]+)" capturera "aaa" puis "b", mais "(?U)(a*)([ab]+)" capturera "" puis "a": en effet, la capture d'une chaîne vide satisfait l'élément frugal "(a*)" et la capture de "a" correspond au sous-modèle frugal "([ab]+)".

source: Possessive quantifiers are atomic and greedy.
fr: Les quantificateurs possessifs sont atomiques et gourmands.

source: In fact they are a short notation for simple atomic groups.
fr: En fait, ils sont une notation abrégée pour les groupes atomiques simples.

source: "\d++" is a shorthand notation for "(?>\d+)" and its behavior is "match a complete sequence of one or more digits, but never give back any".
fr: "\d++" est une notation abrégée pour "(?>\d+)" et son comportement est "faire correspondre une séquence indivisible d'un ou plusieurs chiffres décimaux, sans possibilité d'en restituer une partie seulement par retour arrière".

source: As a consequence "\d++(\d)" can never match since the last digit (in bold) is already matched and locked by "\d++".
fr: En conséquence "\d++(\d)" est un modèle voué à l'échec du fait que le dernier chiffre (en gras) fait forcément partie du groupe indivisible "\d++" qui le précède.

source: This is in contrast with simple greediness, where "\d+(\d)" will first match a complete sequence of digits with "\d+", but then backtrack the last one to allow "(\d)" to capture it.
fr: Par contraste, la gourmandise simple "\d+(\d)" fera d'abord correspondre une séquence complète de chiffres pour satisfaire l'élément "\d+", mais entraînera un retour arrière et la restitution du dernier chiffre de la séquence pour satisfaire sa capture par "(\d)".

source: There are two reasons for using an atomic group or a possessive quantifier: either for matching a sequence of characters that may also appear individually (e.g.
fr: Il y a deux raisons principales qui amènent à employer un groupe atomique ou un quantificateur possessif : pour la correspondance avec une séquence de caractères qui peuvent aussi apparaître individuellement (e.g.

source: "\r\n" in the definition of \R), or for forcing a quick failure in certain situations involving unbounded repetitions, where the engine would normally spend a very long time trying a huge number of grouping combinations before failing.
fr: "\r\n" dans la définition de \R), ou pour forcer rapidement l'échec dans certaines situations utilisant des répétitions non bornées qui amèneraient le moteur à tester un nombre gigantesque de combinaisons de groupements avant de finalement échouer.

source: 0 or 1, greedy.
fr: 0 ou 1, gourmand.

source: 0 or 1, possessive.
fr: 0 ou 1, possessif.

source: 0 or 1, lazy.
fr: 0 ou 1, frugal.

source: 0 or more, greedy.
fr: 0 ou plus, gourmand.

source: 0 or more, possessive.
fr: 0 ou plus, possessif.

source: 0 or more, lazy.
fr: 0 ou plus, frugal.

source: 1 or more, greedy.
fr: 1 ou plus, gourmand.

source: 1 or more, possessive.
fr: 1 ou plus, possessif.

source: 1 or more, lazy.
fr: 1 ou plus, frugal.

source: exactly x.
fr: exactement x.

source: at least x and no more than y, greedy.
fr: au moins x et au plus y, gourmand.

source: at least x and no more than y, possessive.
fr: au moins x et au plus y, possessif.

source: at least x and no more than y, lazy.
fr: au moins x et au plus y, frugal.

source: x or more, greedy.
fr: x ou plus, gourmand.

source: x or more, possessive.
fr: x ou plus, possessif.

source: x or more, lazy.
fr: x ou plus, frugal.

source: Alternation
fr: Alternative

source: Matches either subpattern X or Y:
fr: Correspond à l'une des alternatives X ou Y:

source: "ac|dc|ground" matches "ac" or "dc" or "ground".
fr: "ac|dc|ground" correspond à "ac" ou "dc" ou "ground".

source: Backreferences and references to subroutines
fr: Références arrières et références à des sous-programmes

source: Backreferences permit reuse of the content of a previously captured group.
fr: Les références arrières permettent la réutilisation du contenu d'un groupe précédemment capturé.

source: References a previous capturing group by its absolute number.
fr: Référence au numéro absolu d'un groupe précédemment capturé.

source: WARNING: if no group number n exists, it evaluates as the character with value n provided n is a valid octal value, else errors out.
fr: ATTENTION: si aucun groupe numéroté n n'existe, cet élément est évalué comme le caractère de valeur n si n est une valeur octale valide, sinon d'autres erreurs apparaissent.

source: Due to this ambiguity, this form is not recommended.
fr: En raison de cette ambiguïté, cette formulation est à utiliser avec précaution.

source: Favor the next forms for a safe semantic.
fr: Favorisez les formes suivantes pour une meilleure sécurité sémantique.
